{
  "todo": [
    {
      "id": "design-system",
      "title": "Configure Design System & Global Theme",
      "description": "Set up the V2 color palette, typography (Inter + Fira Code), Material Symbols icons, custom scrollbar, selection styles, and Tailwind v4 @theme tokens per specs-v2/design-system.md. This is a prerequisite for all other section implementations.",
      "spec": "specs-v2/design-system.md"
    },
    {
      "id": "hero-section",
      "title": "Implement Hero Section",
      "description": "Build the hero section per specs-v2/hero-section.md — two-column layout with avatar, terminal stats panel, stat cards, and CTAs using Threadwork design system.",
      "spec": "specs-v2/hero-section.md"
    },
    {
      "id": "navigation",
      "title": "Implement Navigation",
      "description": "Build the sticky navigation bar per specs-v2/navigation.md — system-style branding, live-status indicator, desktop nav links, CTA button, and mobile hamburger menu using Threadwork design system.",
      "spec": "specs-v2/navigation.md"
    },
    {
      "id": "core-competencies",
      "title": "Implement Core Competencies Section",
      "description": "Build the 3-column competency grid per specs-v2/core-competencies.md — icon boxes, titles, descriptions with hover effects using Threadwork design system.",
      "spec": "specs-v2/core-competencies.md"
    },
    {
      "id": "contact-cta",
      "title": "Implement Contact CTA Section",
      "description": "Build the full-width contact call-to-action banner per specs-v2/contact-cta.md — headline, description, status badge, primary CTA button, and social icon links with dot-grid texture using Threadwork design system.",
      "spec": "specs-v2/contact-cta.md"
    },
    {
      "id": "footer",
      "title": "Implement Footer",
      "description": "Build the minimal dark footer per specs-v2/footer.md — branding block, dynamic copyright year, version string, and decorative latency/status indicator using Threadwork design system.",
      "spec": "specs-v2/footer.md"
    },
    {
      "id": "work-experience",
      "title": "Implement Work Experience Section",
      "description": "Build the vertical timeline work history section per specs-v2/work-experience.md — timeline rail with accent dots, experience cards with job title, company, duration, duties list, and tech tags.",
      "spec": "specs-v2/work-experience.md"
    },
    {
      "id": "education",
      "title": "Implement Education & Certifications Section",
      "description": "Build the education and certifications grid per specs-v2/education.md — 2-column responsive grid of degree and certification cards with category badges, credential links, and Threadwork design system styling.",
      "spec": "specs-v2/education.md"
    },
    {
      "id": "skills-marquee",
      "title": "Implement Skills Marquee",
      "description": "Build the dual-row animated skills marquee per specs-v2/skills-marquee.md — two rows of tech skill chips scrolling in opposite directions with accent dots, hover effects, edge fades, and reduced-motion fallback.",
      "spec": "specs-v2/skills-marquee.md"
    }
  ],
  "in_progress": [],
  "done": []
}
