{
  "todo": [
    {
      "id": "card-stack-scroll",
      "title": "Implement Card-Stack Scroll Animation",
      "description": "Build the full-viewport card-stack scroll interaction per specs/card-stack-scroll.md — pin a section (Engineering Log or Work Experience) and stack cards on scroll, with reduced-motion fallback and mobile-disabled behavior.",
      "spec": "specs/card-stack-scroll.md"
    },
    {
      "id": "avatar-hover-reveal",
      "title": "Implement Name & Avatar Hover Reveal",
      "description": "Add cursor-proximity reveal effect to the hero avatar and name — a circular mask around the cursor exposes the GitHub identity (Vonshlovens + GitHub PFP) underneath the display identity, with soft feathered edge, mobile-disabled, and reduced-motion fallback.",
      "spec": "specs/avatar-hover-reveal.md"
    },
    {
      "id": "theme-toggle",
      "title": "Add Dark/Light Theme Toggle",
      "description": "Add a nav-bar theme toggle with a warm parchment light mode alongside the existing dark theme. Includes Svelte store, localStorage persistence, prefers-color-scheme detection, FOUC-prevention script, and light-mode CSS custom properties.",
      "spec": "specs/theme-toggle.md"
    },
    {
      "id": "contact-form",
      "title": "Implement Contact Form Modal",
      "description": "Build a modal contact form triggered by the Contact CTA button — name/email/message fields, SvelteKit form action backend, client-side validation, success/error states, focus trapping, and system-monitor aesthetic per specs/contact-form.md.",
      "spec": "specs/contact-form.md"
    },
    {
      "id": "skill-radar",
      "title": "Implement Skill Radar Chart",
      "description": "Build an interactive SVG radar/spider chart visualizing skill proficiency across 5–7 categories (Frontend, Backend, DevOps, etc.). Pure Svelte + SVG, no charting library. Includes hover tooltips, scroll-reveal draw-in animation, screen-reader fallback table, and responsive layout per specs/skill-radar.md.",
      "spec": "specs/skill-radar.md"
    },
    {
      "id": "404-page",
      "title": "Implement Custom 404 Page",
      "description": "Build a system-monitor themed 404 error page per specs/404-page.md — large Fira Code '404' in accent color, terminal-style error block with dynamic path, 'Return to Index' CTA button, dot-grid texture, responsive layout, accessible headings and focus-visible ring.",
      "spec": "specs/404-page.md"
    },
    {
      "id": "page-transitions",
      "title": "Implement Page Transitions",
      "description": "Add smooth cross-fade transitions between routes per specs/page-transitions.md — use SvelteKit onNavigate hook with View Transitions API (progressive enhancement), CSS cross-fade fallback with {#key} block, 200ms ease-out opacity transition, prefers-reduced-motion skip, compositor-friendly opacity-only animation.",
      "spec": "specs/page-transitions.md"
    },
    {
      "id": "loading-screen",
      "title": "Implement Loading / Splash Screen",
      "description": "Build a system-boot themed splash overlay per specs/loading-screen.md — sequential terminal boot lines with staggered reveal, accent-colored 'OK' and 'SYSTEM READY' text, fade-out exit, sessionStorage once-per-session flag, reduced-motion skip, non-blocking ~1.5s total duration.",
      "spec": "specs/loading-screen.md"
    },
    {
      "id": "responsive-breakpoints",
      "title": "Audit & Enforce Responsive Breakpoints",
      "description": "Audit all sections against specs/responsive-breakpoints.md — verify canonical breakpoint tiers (sm/md/lg/xl), container max-width and padding, grid column counts per breakpoint, typography scaling, 44px minimum touch targets, 320px minimum viewport support, and no horizontal scroll at any breakpoint.",
      "spec": "specs/responsive-breakpoints.md"
    },
    {
      "id": "toast-notifications",
      "title": "Implement Toast Notifications",
      "description": "Build a reusable toast notification system per specs/toast-notifications.md — Svelte 5 rune-based store with addToast/dismissToast, ToastContainer component mounted in +layout.svelte, three variants (success/error/info) with terminal-style styling, auto-dismiss with hover pause, slide-in/out animations, aria-live regions, reduced-motion support, responsive positioning.",
      "spec": "specs/toast-notifications.md"
    },
    {
      "id": "keyboard-shortcuts",
      "title": "Implement Keyboard Shortcuts",
      "description": "Build global keyboard shortcuts with help modal per specs/keyboard-shortcuts.md — ? key opens terminal-styled shortcut reference modal, number keys 1-7 for section navigation, t/m for theme/motion toggle, focus trap, backdrop blur overlay, kbd element styling, form-field suppression, reduced-motion support, desktop-only behavior.",
      "spec": "specs/keyboard-shortcuts.md"
    }
  ],
  "in_progress": [],
  "done": [
    {
      "id": "resume-download",
      "title": "Add Resume PDF Download",
      "description": "Added placeholder resume PDF at static/resume.pdf. Hero 'View Resume' CTA already linked to /resume.pdf — added download='Eric_Evans_Resume.pdf' attribute for save-as fallback. Added 'Download Full Resume →' link at top of Work Experience section with scroll-reveal animation, accent-colored mono styling. PDF opens in new tab with target=_blank and rel=noopener noreferrer. Placeholder PDF should be replaced with actual resume.",
      "spec": "specs/resume-download.md"
    },
    {
      "id": "seo-meta",
      "title": "Configure SEO & Meta Tags",
      "description": "Added <svelte:head> in +layout.svelte with HTML title, meta description, Open Graph (og:type, og:title, og:description, og:image, og:url), Twitter Card (summary_large_image), canonical URL, favicon trio (favicon.ico, icon.svg, apple-touch-icon.png), and JSON-LD Person structured data. Updated og-image.svg and favicon.svg to V2 Stitch palette (#B80C09 accent, #121212 bg). Generated og-image.png (1200x630), apple-touch-icon.png (180x180), favicon-32.png, favicon-16.png, favicon.ico from SVGs. Updated site.webmanifest V2 colors, robots.txt with ericevans.dev domain. Removed duplicate favicon refs from app.html (now in svelte:head).",
      "spec": "specs/seo-meta.md"
    },
    {
      "id": "animation-toggle",
      "title": "Implement Animation Toggle",
      "description": "Built nav-bar animation toggle per specs/animation-toggle.md — icon button in desktop nav (animation/motion_photos_paused Material Symbols), labeled menu item in mobile menu with on/off indicator. Svelte 5 rune-based MotionStore (src/lib/stores/motion.svelte.ts) with $state, localStorage persistence (reduce-motion key), prefers-reduced-motion detection as default, OS preference change listener. Sets data-reduce-motion attribute on <html>. Global CSS override in app.css suppresses all animation-duration, transition-duration, scroll-behavior site-wide. Existing scrollReveal action already checks data-reduce-motion. aria-label, aria-pressed, title tooltip for accessibility.",
      "spec": "specs/animation-toggle.md"
    },
    {
      "id": "skills-marquee",
      "title": "Implement Skills Marquee",
      "description": "Built dual-row animated skills marquee per specs/skills-marquee.md — rewrote from V1 to V2 Stitch design system. Two rows of 10 skill chips each scrolling in opposite directions (30s linear infinite), accent dots (#B80C09), bg-surface cards with border-dim borders, hover effects (border-accent/30, bg-surface-highlight, -translate-y-0.5), left/right edge fade gradients, GPU-accelerated translate3d, will-change-transform, group-hover pause, and prefers-reduced-motion fallback (static wrapped grid). Uses Fira Code mono uppercase tracking-wider typography per V2 spec.",
      "spec": "specs/skills-marquee.md"
    },
    {
      "id": "hero-section",
      "title": "Implement Hero Section",
      "description": "Built hero section per specs/hero-section.md — two-column layout (2/3 + 1/3) with avatar (grayscale-to-color hover, verified badge, glow), name/title/tags, bio quote, 4-column stat cards, dual CTA buttons, and terminal stats panel with decorative key-value pairs and status indicator. Uses V2 Stitch design tokens, Material Symbols, dot-grid and scan-line textures. Responsive (stacks on mobile, 2-col on lg). Extracted as src/lib/components/sections/Hero.svelte.",
      "spec": "specs/hero-section.md"
    },
    {
      "id": "design-system",
      "title": "Configure Design System & Global Theme",
      "description": "Set up the V2 color palette, typography (Inter + Fira Code), Material Symbols icons, custom scrollbar, selection styles, and Tailwind v4 @theme tokens per specs/design-system.md. This is a prerequisite for all other section implementations.",
      "spec": "specs/design-system.md"
    },
    {
      "id": "navigation",
      "title": "Implement Navigation",
      "description": "Built sticky nav bar per specs/navigation.md — EE_SYS brand, live-status ping indicator, desktop nav links, View Source CTA, mobile hamburger menu with slide-down animation, skip-to-content link, ARIA attributes, Escape-to-close, V2 Stitch design tokens.",
      "spec": "specs/navigation.md"
    },
    {
      "id": "footer",
      "title": "Implement Footer",
      "description": "Built minimal dark footer per specs/footer.md — three-column layout (branding, copyright, status indicator), dynamic copyright year, v2.0_STABLE version string, decorative latency readout with green status dot, #0A0A0A background, responsive stacking on mobile. Extracted as src/lib/components/layout/Footer.svelte.",
      "spec": "specs/footer.md"
    },
    {
      "id": "core-competencies",
      "title": "Implement Core Competencies Section",
      "description": "Built 3-column competency grid per specs/core-competencies.md — icon boxes (Material Symbols), titles, descriptions with hover effects (border-accent, icon color shift, bg-surface-highlight). Uses V2 Stitch design tokens. Responsive: stacks single-column on mobile, 3-col on md+. Extracted as src/lib/components/sections/CoreCompetencies.svelte.",
      "spec": "specs/core-competencies.md"
    },
    {
      "id": "work-experience",
      "title": "Implement Work Experience Section",
      "description": "Built vertical timeline work history section per specs/work-experience.md — timeline rail (2px border-dim line) with 12px accent dots on desktop, top accent border on mobile. Experience cards with mono uppercase job title, accent company name, tiny mono duration/location metadata, left-bordered duty list items (sans-serif), and uppercase tech tag pills. Uses V2 Stitch design tokens (bg-surface, border-border-dim, text-text-main). Hover border transitions to accent/50. Data cleaned to V2 WorkExperience interface. Extracted as src/lib/components/sections/WorkExperience.svelte.",
      "spec": "specs/work-experience.md"
    },
    {
      "id": "education",
      "title": "Implement Education & Certifications Section",
      "description": "Built 2-column education grid per specs/education.md — degree and certification cards with Material Symbols school icon header, category badges (DEGREE/CERTIFICATION), mono typography, credential links with arrow icons, accent hover borders. Uses V2 Stitch design tokens (bg-surface, border-border-dim, text-text-main, text-accent). Responsive: single-column mobile, 2-col on md+. Extracted as src/lib/components/sections/Education.svelte.",
      "spec": "specs/education.md"
    },
    {
      "id": "interests",
      "title": "Implement Interests / Beyond Code Section",
      "description": "Built 3-column interests card grid per specs/interests.md — Material Symbols icons in icon boxes (bg-primary/50, group-hover accent transitions), mono titles, muted descriptions, optional link arrows with accent color. Uses V2 Stitch design tokens (bg-surface, border-border-dim, hover:border-accent, bg-surface-highlight). Responsive: single-column mobile, 2-col md, 3-col lg. Data imported from src/lib/data/interests.ts with updated Material Symbols icon names. Extracted as src/lib/components/sections/Interests.svelte.",
      "spec": "specs/interests.md"
    },
    {
      "id": "contact-cta",
      "title": "Implement Contact CTA Section",
      "description": "Built full-width 'Initialize Protocol?' CTA banner per specs/contact-cta.md — two-column layout (text+status left, CTA+icons right) with dot-grid texture overlay, 'Connect.exe' accent button (hover: bg swap to white), status badge (STATUS: READY_TO_COLLABORATE in status-ok green), Material Symbols social icon links (mail, terminal, hub) with accent hover. Uses V2 Stitch design tokens (bg-surface, border-border-dim, text-text-white, text-text-muted, bg-accent). Responsive: stacks centered on mobile, side-by-side on md+. Section has aria-labelledby, icons have aria-label. Extracted as src/lib/components/sections/ContactCTA.svelte, replaced old V1 contact section.",
      "spec": "specs/contact-cta.md"
    },
    {
      "id": "engineering-log",
      "title": "Implement Engineering Log Section",
      "description": "Built vertically stacked engineering log per specs/engineering-log.md — replaced V1 grid project cards with horizontal project cards (image 1/3, content 2/3 on lg, stacked on mobile). Grayscale-to-color image on card hover, structured narrative sections ([The Problem], [Key Learnings], [Tech Stack]) with accent-colored uppercase mono labels, category badges (bg-accent/20 text-accent), tech tag pills (bg-primary border-border-dim), section header with active project count and pulsing status-ok indicator. Uses V2 Stitch design tokens (bg-surface, border-border-dim, hover:border-accent/50). Data file src/lib/data/engineering-log.ts with EngineeringLogEntry interface. Component extracted as src/lib/components/sections/EngineeringLog.svelte.",
      "spec": "specs/engineering-log.md"
    },
    {
      "id": "scroll-animations",
      "title": "Implement Scroll-Triggered Entrance Animations",
      "description": "Built reusable Svelte action (use:scrollReveal) using a shared IntersectionObserver per specs/scroll-animations.md. Fade-up entrance (opacity 0→1, translateY 24px→0, 600ms ease-out) with stagger support for grid children (100ms delay per child, capped at 500ms). Applied to CoreCompetencies (heading + staggered cards), EngineeringLog (heading + sequential cards), SkillsMarquee (whole section), WorkExperience (heading + sequential entries), Education (heading + staggered cards), Interests (heading + staggered cards), ContactCTA (whole banner). Hero and Footer excluded per spec. CSS in app.css with scroll-reveal/revealed classes. Respects prefers-reduced-motion and data-reduce-motion attribute (shows all elements immediately). Single shared observer, unobserve after reveal, compositor-friendly opacity+transform only. Action file: src/lib/actions/scrollReveal.ts.",
      "spec": "specs/scroll-animations.md"
    },
    {
      "id": "github-stats",
      "title": "Integrate Live GitHub Stats",
      "description": "Created src/routes/+page.server.ts to fetch live GitHub data (repo count, commit count, account age) from the public GitHub REST API with 10-minute in-memory cache, optional GITHUB_TOKEN auth, and static fallbacks. Updated +page.svelte to pass githubStats prop to Hero. Refactored Hero.svelte stat cards (Repos, Commits, Status, Tier) and terminal panel (repos, age dynamically populated) with aria-label on stat cards and aria-hidden on the decorative terminal panel. Terminal lines updated to match spec (user, role, notes, repos, age, 100m, 200m).",
      "spec": "specs/github-stats.md"
    },
    {
      "id": "performance",
      "title": "Apply Performance Optimizations",
      "description": "Enabled static prerendering via src/routes/+layout.ts (export const prerender = true). Added decoding='async' to hero avatar and engineering log images. Engineering log images already had loading='lazy'. Added preconnect hints for github.com and avatars.githubusercontent.com (hero avatar). Created src/hooks.server.ts with Cache-Control headers: immutable for hashed JS/CSS bundles, 7-day for images, must-revalidate for HTML. Configured svelte.config.js prerender.handleHttpError to ignore missing project placeholder images. Fixed broken #projects anchor links in nav and hero to point to #engineering-log.",
      "spec": "specs/performance.md"
    },
    {
      "id": "accessibility",
      "title": "Implement Accessibility Standards",
      "description": "Implemented WCAG 2.1 AA accessibility standards per specs/accessibility.md. Moved skip-to-main-content link to +layout.svelte (before <header>, first focusable element). Added mobile menu focus trap (Tab trapped within menu while open, focus moves to menu on open, Escape returns focus to hamburger button). Fixed SkillsMarquee: replaced section-level aria-hidden with aria-label='Technical Skills' and aria-hidden only on cloned duplicates. Added (opens in new tab) sr-only text to all external links (Navigation, Hero, WorkExperience, Education, Interests, ContactCTA). Converted all sections from aria-label to aria-labelledby with IDs on <h2>/<h1> headings (Hero, CoreCompetencies, WorkExperience, Education, Interests). Added aria-label='Status: active' to nav status indicator. Added aria-hidden to decorative elements (dot-grid textures, scan lines, terminal prompt, accent dots, icon spans). Global focus-visible styles (accent ring) already in app.css. Reduced motion support already implemented via animation toggle + prefers-reduced-motion.",
      "spec": "specs/accessibility.md"
    }
  ]
}
