{
  "todo": [],
  "in_progress": [],
  "done": [
    {
      "id": "skills-marquee-icons",
      "title": "Add SVG Logos to Skills Marquee Chips (Phase 1)",
      "description": "Added inline SVG technology logos to each skill chip in the SkillsMarquee component. Created src/lib/data/skill-icons.ts with SkillIcon interface mapping all 20 skills (Python, JavaScript, TypeScript, Svelte, Deno, Node, Go, Azure, GCP, Terraform, Docker, Kubernetes, Tailwind, RabbitMQ, FastAPI, Bun, LLMs, PostgreSQL, Redis, Git) to simplified SVG path data and brand colors. Icons render at w-3.5 h-3.5 (mobile) / w-4 h-4 (desktop) replacing the red accent dot. Default icon color is text-muted (#888888, monochrome); on chip hover, icon transitions to the technology's brand color via CSS custom property --brand-color with 200ms transition. Fallback to accent dot for any skill without an icon entry. Build and lint pass clean.",
      "spec": "specs/skills-marquee.md"
    },
    {
      "id": "engineering-log-images",
      "title": "Add Placeholder Images for Engineering Log Projects",
      "description": "Created 6 system-monitor themed WebP placeholder images for the engineering log projects (cloud-orchestrator, ml-pipeline, realtime-dashboard, api-gateway, db-migration, component-lib). Each image uses the design system aesthetic (#121212 bg, #B80C09 accent, dot-grid texture) with project-relevant visuals: cloud nodes with connections, pipeline stages with data points, realtime line chart, API gateway architecture, database cylinders with migration arrow, and UI component grid. Generated as SVGs then converted to WebP via rsvg-convert + ImageMagick (~2-3 KB each, ~16 KB total). Created static/images/projects/ directory. Eliminates 404 console errors from missing project images. Build passes clean.",
      "spec": "specs/engineering-log.md"
    },
    {
      "id": "fix-contact-form-pii-logging",
      "title": "Fix PII Logging in Contact Form",
      "description": "Removed personally identifiable information (name, email, message) from the console.log in the contact form dev fallback path. When RESEND_API_KEY/CONTACT_EMAIL_TO are not configured, the server previously logged the full form submission including user PII. Now logs only that a submission was discarded. Also sanitized the catch-block console.error to log only err.message instead of the full error object (which could contain request/response data with PII). Build and lint pass clean.",
      "spec": "specs/contact-form.md"
    },
    {
      "id": "extract-github-stats-type",
      "title": "Extract GitHubStats Interface to Shared Types",
      "description": "Moved GitHubStats interface from src/routes/+page.server.ts to src/lib/types/github.ts. Hero.svelte was importing the type via a fragile relative path ('../../routes/+page.server') that crossed the lib/routes boundary and broke svelte-check type resolution. Now both +page.server.ts and Hero.svelte import from '$lib/types/github'. The server file re-exports the type for backward compatibility. Build and lint pass clean (19 files).",
      "spec": "specs/github-stats.md"
    },
    {
      "id": "remove-dead-code",
      "title": "Remove Dead Code & Unused Dependency",
      "description": "Deleted 3 orphaned V1 files: ProjectCard.svelte (unused component, never imported), ThemeToggle.svelte (superseded by inline toggle in Navigation.svelte, used V1 svelte-lucide icons instead of Material Symbols), and projects.ts (superseded by engineering-log.ts data file). Removed svelte-lucide dependency from package.json (only consumer was the deleted ThemeToggle). Regenerated deno.lock. Build and lint pass clean (18 files, down from 19).",
      "spec": "specs/performance.md"
    },
    {
      "id": "cleanup-static-assets",
      "title": "Remove Unused Static Assets",
      "description": "Removed ~89MB of unused files from static/ directory: IMG_6230.png (87MB random personal photo), how-strong-is-saitama-v0-ls463j4fizle1.webp (44KB unrelated image), and 4 CommitMono font files (1.5MB total — site uses Google Fonts for Inter and Fira Code, not self-hosted CommitMono). None of these files were referenced anywhere in the source code. Empty static/fonts/ directory removed. Build and lint pass clean.",
      "spec": "specs/performance.md"
    },
    {
      "id": "contact-form-toast",
      "title": "Wire Toast Notifications to Contact Form",
      "description": "Connected the existing toast notification system to ContactForm submission results. On success, fires a 'success' toast ('Message sent successfully.') so users see confirmation even after the modal auto-closes. On failure (server error or unexpected result), fires an 'error' toast with the error message. In-modal success/error states remain unchanged as primary feedback; toasts provide persistent supplementary feedback. Import added: addToast from $lib/stores/toast.svelte. Build and lint pass clean.",
      "spec": "specs/contact-form.md"
    },
    {
      "id": "remove-duplicate-seo-footer",
      "title": "Remove Duplicate SEO & Footer from +page.svelte",
      "description": "Removed duplicate inline footer (lines 82-88) from +page.svelte that rendered a second footer below the proper Footer.svelte already mounted in +layout.svelte. Removed duplicate SEO.svelte component import and usage from +page.svelte — the layout already handles all meta tags (title, OG, Twitter, canonical, JSON-LD, favicon) with correct domain (ericevans.dev). The orphaned SEO.svelte component had stale defaults (url: example.com, blue theme-colors) that conflicted with layout meta tags. Deleted src/lib/components/SEO.svelte entirely. Page bundle reduced ~5 kB. Lint and build pass clean.",
      "spec": "specs/seo-meta.md"
    },
    {
      "id": "bits-ui-dialog",
      "title": "Integrate Bits UI Dialog for Modals",
      "description": "Added bits-ui dependency and refactored both modal components (ContactForm, KeyboardShortcuts) from custom implementations to Bits UI Dialog primitives. Replaced hand-rolled focus traps, Escape key handling, backdrop click dismissal, and ARIA attributes with Dialog.Root/Portal/Overlay/Content/Title/Close. ContactForm uses onOpenChange callback for state reset and trigger focus restoration, onInteractOutside to prevent close during submission. KeyboardShortcuts retains svelte:window onkeydown for global shortcuts (?, t, m, h, 1-7) while delegating modal Escape/Tab/focus-trap to Bits UI. Moved modal-enter animation to app.css (global) since Dialog.Portal renders outside component DOM. Build and lint pass clean with zero warnings.",
      "spec": "specs/bits-ui.md"
    },
    {
      "id": "fix-lint-errors",
      "title": "Fix Deno Lint Errors",
      "description": "Fixed 6 deno lint errors across 4 files. Removed unnecessary async from sitemap.xml GET handler (require-await). Replaced window with globalThis for matchMedia calls in motion.svelte.ts (2), theme.svelte.ts (2), and scrollReveal.ts (1) to satisfy no-window lint rule. Updated typeof window checks to typeof globalThis.window for SSR guard consistency. Build and lint both pass clean.",
      "spec": "specs/deno.md"
    },
    {
      "id": "ci-cd-deploy",
      "title": "Add GitHub Actions CI/CD for Deno Deploy",
      "description": "Created .github/workflows/deploy.yml GitHub Actions workflow for automatic deployment to Deno Deploy on push to main. Uses denoland/setup-deno@v2 with Deno v2.x, runs deno install + deno task build, then deploys via denoland/deployctl@v1 with entrypoint .deno-deploy/server.ts (output of @deno/svelte-adapter). Requires id-token:write permission for OIDC auth and a Deno Deploy project named 'eric-website'. No secrets needed — uses GitHub OIDC token exchange.",
      "spec": "specs/deno-deploy.md"
    },
    {
      "id": "active-section-nav",
      "title": "Implement Active Section Highlighting in Navigation",
      "description": "Added Intersection Observer-based active section highlighting to Navigation.svelte. As the user scrolls, the nav link corresponding to the currently visible section highlights (text-text-white vs text-text-muted). Uses rootMargin '-50% 0px -50% 0px' to trigger when a section crosses the viewport midpoint. Applies to both desktop and mobile nav links. Adds aria-current attribute on active link for accessibility. Observer created on mount and disconnected on destroy. Default active section is 'about' (hero).",
      "spec": "specs/navigation.md"
    },
    {
      "id": "email-integration",
      "title": "Integrate Resend Email Service for Contact Form",
      "description": "Replaced contact form console.log placeholder with Resend email delivery. Added resend npm dependency. Contact form action in +page.server.ts now sends emails via Resend API when RESEND_API_KEY and CONTACT_EMAIL_TO env vars are configured; falls back to console.log when unconfigured (local dev). Uses $env/dynamic/private for all server env vars (also migrated GITHUB_TOKEN from process.env). Supports optional RESEND_FROM_EMAIL for custom verified sender. Created .env.example documenting all environment variables (GITHUB_TOKEN, RESEND_API_KEY, CONTACT_EMAIL_TO, RESEND_FROM_EMAIL, PUBLIC_ANALYTICS_ENABLED).",
      "spec": "specs/contact-form.md"
    },
    {
      "id": "fix-build-warnings",
      "title": "Fix Build Warnings & Accessibility Issues",
      "description": "Resolved all Svelte build warnings for a clean zero-warning build. Fixed Hero.svelte state_referenced_locally warnings (5 instances) by converting const declarations to $derived runes for githubStats-dependent values (formattedCommits, formattedRepos, formattedAge, stats, terminalLines). Fixed SkillRadar.svelte import path (removed erroneous .ts extension from motion.svelte import). Suppressed SkillRadar.svelte a11y_no_static_element_interactions warnings on <text> and <circle> SVG elements that are inside an aria-hidden='true' SVG with a screen-reader fallback table. Fixed ContactForm.svelte a11y_click_events_have_key_events warning on modal backdrop by adding role='presentation' (backdrop is decorative; Escape key handling exists on svelte:window).",
      "spec": "specs/accessibility.md"
    },
    {
      "id": "responsive-breakpoints",
      "title": "Audit & Enforce Responsive Breakpoints",
      "description": "Audited and fixed all sections against specs/responsive-breakpoints.md. Corrected container max-width from max-w-7xl to max-w-6xl (1152px) across all 10 section components. Fixed horizontal padding progression to px-4 (mobile) → sm:px-6 → lg:px-8 across Hero, CoreCompetencies, EngineeringLog, WorkExperience, Education, Interests, SkillRadar, ContactCTA, Footer, and Navigation. Fixed Navigation breakpoint from md to lg (desktop nav at lg+, hamburger below lg). Fixed EngineeringLog card-stack activation from min-width:768px to min-width:1024px (lg). Fixed 44px minimum touch targets: Navigation hamburger (w-10 h-10), desktop nav links (py-3), theme/animation toggle buttons (w-10 h-10), CTA buttons (py-3 px-6), mobile menu links (py-3, min-h-[44px]), ContactForm close button (w-10 h-10), ContactCTA social icons (w-11 h-11). Fixed typography scaling: Hero heading text-2xl→sm:text-4xl→md:text-6xl, terminal panel text-xs→sm:text-sm, ContactCTA heading text-2xl→sm:text-3xl. Fixed ContactForm modal responsive padding (p-4→sm:p-6→md:p-8). Updated print stylesheet selector from max-w-7xl to max-w-6xl.",
      "spec": "specs/responsive-breakpoints.md"
    },
    {
      "id": "skill-radar",
      "title": "Implement Skill Radar Chart",
      "description": "Built interactive SVG radar/spider chart per specs/skill-radar.md — 6 category axes (Frontend, Backend, DevOps, Cloud, Databases, AI/ML) radiating from center with 3 concentric grid rings (Familiar/Proficient/Expert). Pure Svelte 5 + inline SVG, no charting library. Semi-transparent accent fill polygon with solid accent stroke, accent-colored vertex dots. Hover on vertex or axis label highlights category and shows tooltip with skill list (bg-surface-highlight card with shadow). Two-column layout on lg (chart left, breakdown list right), single-column stacked on mobile. Breakdown list shows proficiency bars, percentage, and skill tags per category with hover cross-highlighting to chart. Scroll-reveal draw-in animation via MutationObserver watching for 'revealed' class, respects motionStore.disabled and prefers-reduced-motion. Screen-reader fallback table with category/proficiency/skills data (aria-hidden on decorative SVG). Data in src/lib/data/skills.ts with SkillCategory interface. Component: src/lib/components/sections/SkillRadar.svelte, placed after SkillsMarquee in +page.svelte.",
      "spec": "specs/skill-radar.md"
    },
    {
      "id": "avatar-hover-reveal",
      "title": "Implement Name & Avatar Hover Reveal",
      "description": "Added cursor-proximity hover reveal to hero avatar and name per specs/avatar-hover-reveal.md. Two-layer stack: bottom layer shows GitHub identity (full-color avatar + 'Vonshlovens' username + '@Vonshlovens' subtitle), top layer shows display identity ('Eric Evans' + grayscale avatar + 'Software Developer'). Top layer uses CSS radial-gradient mask-image centered on cursor position (100px radius, 60%-100% feather) to punch a circular window revealing the GitHub layer beneath. Mouse tracking via onmousemove/onmouseleave on reveal container with Svelte 5 $state reactivity. Gated by (hover: hover) media query (disables on touch/mobile) and motionStore.disabled (respects reduced-motion preference and animation toggle). Bottom layer has aria-hidden='true', top layer contains the accessible h1#hero-heading. will-change:mask-image hint for GPU compositing. -webkit-mask-image vendor prefix included. No external libraries. Component: src/lib/components/sections/Hero.svelte.",
      "spec": "specs/avatar-hover-reveal.md"
    },
    {
      "id": "card-stack-scroll",
      "title": "Implement Card-Stack Scroll Animation",
      "description": "Built full-viewport card-stack scroll interaction on Engineering Log per specs/card-stack-scroll.md. Section container height set to cardCount × 100vh, sticky inner viewport at top:0 with h-screen. Each card positioned absolute with translateY driven by scroll progress (scrollY - sectionTop mapped to per-card viewport ranges). Cards layer via z-index order — later cards stack higher, sliding up from bottom to cover previous. Progress dot indicators (top-right) and card counter (bottom-right) as decorative overlays. Reactive Svelte 5 $effect watches min-width:768px media query, prefers-reduced-motion, and data-reduce-motion attribute (MutationObserver) to toggle between card-stack and fallback modes. Mobile (<md) and reduced-motion fall back to original vertical card list with scrollReveal fade-up animations. will-change:transform and backface-visibility:hidden on .card-stack-card for GPU compositing. Print stylesheet resets card-stack-card to static positioning. No external libraries. Component: src/lib/components/sections/EngineeringLog.svelte.",
      "spec": "specs/card-stack-scroll.md"
    },
    {
      "id": "contact-form",
      "title": "Implement Contact Form Modal",
      "description": "Built modal contact form per specs/contact-form.md — triggered by Connect.exe CTA button in ContactCTA section. Terminal-themed modal (> init_contact.sh prompt) with name/email/message fields, client-side validation (required, email format, max length), inline error messages with aria-describedby. SvelteKit form action at ?/contact with server-side validation, use:enhance for progressive enhancement. Success state shows 'Transmission Received' with check_circle icon and auto-close after 3s. Error state with retry option. Focus trap within modal, Escape/backdrop click to close, focus return to CTA trigger. Modal entrance animation (scale 95%→100%, fade in) with reduced-motion support. Page prerender disabled (src/routes/+page.ts) to support form actions. Email delivery pluggable via TODO placeholder (console.log for dev). Component: src/lib/components/ContactForm.svelte.",
      "spec": "specs/contact-form.md"
    },
    {
      "id": "analytics",
      "title": "Integrate Privacy-Respecting Analytics",
      "description": "Integrated Plausible Analytics in +layout.svelte <svelte:head> — single deferred <script> tag with data-domain='ericevans.dev', gated by PUBLIC_ANALYTICS_ENABLED env var via $env/dynamic/public. Cookie-free, GDPR-compliant, no consent banner. < 1 KB gzipped script. Plausible handles SPA navigation tracking natively (History API), localhost exclusion (data-domain mismatch), and bot filtering. No afterNavigate hook needed.",
      "spec": "specs/analytics.md"
    },
    {
      "id": "resume-download",
      "title": "Add Resume PDF Download",
      "description": "Added placeholder resume PDF at static/resume.pdf. Hero 'View Resume' CTA already linked to /resume.pdf — added download='Eric_Evans_Resume.pdf' attribute for save-as fallback. Added 'Download Full Resume →' link at top of Work Experience section with scroll-reveal animation, accent-colored mono styling. PDF opens in new tab with target=_blank and rel=noopener noreferrer. Placeholder PDF should be replaced with actual resume.",
      "spec": "specs/resume-download.md"
    },
    {
      "id": "seo-meta",
      "title": "Configure SEO & Meta Tags",
      "description": "Added <svelte:head> in +layout.svelte with HTML title, meta description, Open Graph (og:type, og:title, og:description, og:image, og:url), Twitter Card (summary_large_image), canonical URL, favicon trio (favicon.ico, icon.svg, apple-touch-icon.png), and JSON-LD Person structured data. Updated og-image.svg and favicon.svg to V2 Stitch palette (#B80C09 accent, #121212 bg). Generated og-image.png (1200x630), apple-touch-icon.png (180x180), favicon-32.png, favicon-16.png, favicon.ico from SVGs. Updated site.webmanifest V2 colors, robots.txt with ericevans.dev domain. Removed duplicate favicon refs from app.html (now in svelte:head).",
      "spec": "specs/seo-meta.md"
    },
    {
      "id": "animation-toggle",
      "title": "Implement Animation Toggle",
      "description": "Built nav-bar animation toggle per specs/animation-toggle.md — icon button in desktop nav (animation/motion_photos_paused Material Symbols), labeled menu item in mobile menu with on/off indicator. Svelte 5 rune-based MotionStore (src/lib/stores/motion.svelte.ts) with $state, localStorage persistence (reduce-motion key), prefers-reduced-motion detection as default, OS preference change listener. Sets data-reduce-motion attribute on <html>. Global CSS override in app.css suppresses all animation-duration, transition-duration, scroll-behavior site-wide. Existing scrollReveal action already checks data-reduce-motion. aria-label, aria-pressed, title tooltip for accessibility.",
      "spec": "specs/animation-toggle.md"
    },
    {
      "id": "skills-marquee",
      "title": "Implement Skills Marquee",
      "description": "Built dual-row animated skills marquee per specs/skills-marquee.md — rewrote from V1 to V2 Stitch design system. Two rows of 10 skill chips each scrolling in opposite directions (30s linear infinite), accent dots (#B80C09), bg-surface cards with border-dim borders, hover effects (border-accent/30, bg-surface-highlight, -translate-y-0.5), left/right edge fade gradients, GPU-accelerated translate3d, will-change-transform, group-hover pause, and prefers-reduced-motion fallback (static wrapped grid). Uses Fira Code mono uppercase tracking-wider typography per V2 spec.",
      "spec": "specs/skills-marquee.md"
    },
    {
      "id": "hero-section",
      "title": "Implement Hero Section",
      "description": "Built hero section per specs/hero-section.md — two-column layout (2/3 + 1/3) with avatar (grayscale-to-color hover, verified badge, glow), name/title/tags, bio quote, 4-column stat cards, dual CTA buttons, and terminal stats panel with decorative key-value pairs and status indicator. Uses V2 Stitch design tokens, Material Symbols, dot-grid and scan-line textures. Responsive (stacks on mobile, 2-col on lg). Extracted as src/lib/components/sections/Hero.svelte.",
      "spec": "specs/hero-section.md"
    },
    {
      "id": "design-system",
      "title": "Configure Design System & Global Theme",
      "description": "Set up the V2 color palette, typography (Inter + Fira Code), Material Symbols icons, custom scrollbar, selection styles, and Tailwind v4 @theme tokens per specs/design-system.md. This is a prerequisite for all other section implementations.",
      "spec": "specs/design-system.md"
    },
    {
      "id": "navigation",
      "title": "Implement Navigation",
      "description": "Built sticky nav bar per specs/navigation.md — EE_SYS brand, live-status ping indicator, desktop nav links, View Source CTA, mobile hamburger menu with slide-down animation, skip-to-content link, ARIA attributes, Escape-to-close, V2 Stitch design tokens.",
      "spec": "specs/navigation.md"
    },
    {
      "id": "footer",
      "title": "Implement Footer",
      "description": "Built minimal dark footer per specs/footer.md — three-column layout (branding, copyright, status indicator), dynamic copyright year, v2.0_STABLE version string, decorative latency readout with green status dot, #0A0A0A background, responsive stacking on mobile. Extracted as src/lib/components/layout/Footer.svelte.",
      "spec": "specs/footer.md"
    },
    {
      "id": "core-competencies",
      "title": "Implement Core Competencies Section",
      "description": "Built 3-column competency grid per specs/core-competencies.md — icon boxes (Material Symbols), titles, descriptions with hover effects (border-accent, icon color shift, bg-surface-highlight). Uses V2 Stitch design tokens. Responsive: stacks single-column on mobile, 3-col on md+. Extracted as src/lib/components/sections/CoreCompetencies.svelte.",
      "spec": "specs/core-competencies.md"
    },
    {
      "id": "work-experience",
      "title": "Implement Work Experience Section",
      "description": "Built vertical timeline work history section per specs/work-experience.md — timeline rail (2px border-dim line) with 12px accent dots on desktop, top accent border on mobile. Experience cards with mono uppercase job title, accent company name, tiny mono duration/location metadata, left-bordered duty list items (sans-serif), and uppercase tech tag pills. Uses V2 Stitch design tokens (bg-surface, border-border-dim, text-text-main). Hover border transitions to accent/50. Data cleaned to V2 WorkExperience interface. Extracted as src/lib/components/sections/WorkExperience.svelte.",
      "spec": "specs/work-experience.md"
    },
    {
      "id": "education",
      "title": "Implement Education & Certifications Section",
      "description": "Built 2-column education grid per specs/education.md — degree and certification cards with Material Symbols school icon header, category badges (DEGREE/CERTIFICATION), mono typography, credential links with arrow icons, accent hover borders. Uses V2 Stitch design tokens (bg-surface, border-border-dim, text-text-main, text-accent). Responsive: single-column mobile, 2-col on md+. Extracted as src/lib/components/sections/Education.svelte.",
      "spec": "specs/education.md"
    },
    {
      "id": "interests",
      "title": "Implement Interests / Beyond Code Section",
      "description": "Built 3-column interests card grid per specs/interests.md — Material Symbols icons in icon boxes (bg-primary/50, group-hover accent transitions), mono titles, muted descriptions, optional link arrows with accent color. Uses V2 Stitch design tokens (bg-surface, border-border-dim, hover:border-accent, bg-surface-highlight). Responsive: single-column mobile, 2-col md, 3-col lg. Data imported from src/lib/data/interests.ts with updated Material Symbols icon names. Extracted as src/lib/components/sections/Interests.svelte.",
      "spec": "specs/interests.md"
    },
    {
      "id": "contact-cta",
      "title": "Implement Contact CTA Section",
      "description": "Built full-width 'Initialize Protocol?' CTA banner per specs/contact-cta.md — two-column layout (text+status left, CTA+icons right) with dot-grid texture overlay, 'Connect.exe' accent button (hover: bg swap to white), status badge (STATUS: READY_TO_COLLABORATE in status-ok green), Material Symbols social icon links (mail, terminal, hub) with accent hover. Uses V2 Stitch design tokens (bg-surface, border-border-dim, text-text-white, text-text-muted, bg-accent). Responsive: stacks centered on mobile, side-by-side on md+. Section has aria-labelledby, icons have aria-label. Extracted as src/lib/components/sections/ContactCTA.svelte, replaced old V1 contact section.",
      "spec": "specs/contact-cta.md"
    },
    {
      "id": "engineering-log",
      "title": "Implement Engineering Log Section",
      "description": "Built vertically stacked engineering log per specs/engineering-log.md — replaced V1 grid project cards with horizontal project cards (image 1/3, content 2/3 on lg, stacked on mobile). Grayscale-to-color image on card hover, structured narrative sections ([The Problem], [Key Learnings], [Tech Stack]) with accent-colored uppercase mono labels, category badges (bg-accent/20 text-accent), tech tag pills (bg-primary border-border-dim), section header with active project count and pulsing status-ok indicator. Uses V2 Stitch design tokens (bg-surface, border-border-dim, hover:border-accent/50). Data file src/lib/data/engineering-log.ts with EngineeringLogEntry interface. Component extracted as src/lib/components/sections/EngineeringLog.svelte.",
      "spec": "specs/engineering-log.md"
    },
    {
      "id": "scroll-animations",
      "title": "Implement Scroll-Triggered Entrance Animations",
      "description": "Built reusable Svelte action (use:scrollReveal) using a shared IntersectionObserver per specs/scroll-animations.md. Fade-up entrance (opacity 0→1, translateY 24px→0, 600ms ease-out) with stagger support for grid children (100ms delay per child, capped at 500ms). Applied to CoreCompetencies (heading + staggered cards), EngineeringLog (heading + sequential cards), SkillsMarquee (whole section), WorkExperience (heading + sequential entries), Education (heading + staggered cards), Interests (heading + staggered cards), ContactCTA (whole banner). Hero and Footer excluded per spec. CSS in app.css with scroll-reveal/revealed classes. Respects prefers-reduced-motion and data-reduce-motion attribute (shows all elements immediately). Single shared observer, unobserve after reveal, compositor-friendly opacity+transform only. Action file: src/lib/actions/scrollReveal.ts.",
      "spec": "specs/scroll-animations.md"
    },
    {
      "id": "github-stats",
      "title": "Integrate Live GitHub Stats",
      "description": "Created src/routes/+page.server.ts to fetch live GitHub data (repo count, commit count, account age) from the public GitHub REST API with 10-minute in-memory cache, optional GITHUB_TOKEN auth, and static fallbacks. Updated +page.svelte to pass githubStats prop to Hero. Refactored Hero.svelte stat cards (Repos, Commits, Status, Tier) and terminal panel (repos, age dynamically populated) with aria-label on stat cards and aria-hidden on the decorative terminal panel. Terminal lines updated to match spec (user, role, notes, repos, age, 100m, 200m).",
      "spec": "specs/github-stats.md"
    },
    {
      "id": "performance",
      "title": "Apply Performance Optimizations",
      "description": "Enabled static prerendering via src/routes/+layout.ts (export const prerender = true). Added decoding='async' to hero avatar and engineering log images. Engineering log images already had loading='lazy'. Added preconnect hints for github.com and avatars.githubusercontent.com (hero avatar). Created src/hooks.server.ts with Cache-Control headers: immutable for hashed JS/CSS bundles, 7-day for images, must-revalidate for HTML. Configured svelte.config.js prerender.handleHttpError to ignore missing project placeholder images. Fixed broken #projects anchor links in nav and hero to point to #engineering-log.",
      "spec": "specs/performance.md"
    },
    {
      "id": "accessibility",
      "title": "Implement Accessibility Standards",
      "description": "Implemented WCAG 2.1 AA accessibility standards per specs/accessibility.md. Moved skip-to-main-content link to +layout.svelte (before <header>, first focusable element). Added mobile menu focus trap (Tab trapped within menu while open, focus moves to menu on open, Escape returns focus to hamburger button). Fixed SkillsMarquee: replaced section-level aria-hidden with aria-label='Technical Skills' and aria-hidden only on cloned duplicates. Added (opens in new tab) sr-only text to all external links (Navigation, Hero, WorkExperience, Education, Interests, ContactCTA). Converted all sections from aria-label to aria-labelledby with IDs on <h2>/<h1> headings (Hero, CoreCompetencies, WorkExperience, Education, Interests). Added aria-label='Status: active' to nav status indicator. Added aria-hidden to decorative elements (dot-grid textures, scan lines, terminal prompt, accent dots, icon spans). Global focus-visible styles (accent ring) already in app.css. Reduced motion support already implemented via animation toggle + prefers-reduced-motion.",
      "spec": "specs/accessibility.md"
    },
    {
      "id": "404-page",
      "title": "Implement Custom 404 Page",
      "description": "Built system-monitor themed +error.svelte per specs/404-page.md — large Fira Code '404' in accent color, terminal-style error block with dynamic $page.url.pathname, 'Return to Index' CTA button (bg-accent, hover swap to white), dot-grid texture and scan-line overlay, generic error fallback for non-404 status codes, responsive text scaling (text-5xl to text-8xl), accessible <title>, aria-label on CTA, focus-visible ring.",
      "spec": "specs/404-page.md"
    },
    {
      "id": "robots-txt",
      "title": "Implement Robots.txt",
      "description": "Cleaned up static/robots.txt to match spec exactly — User-agent * Allow /, Sitemap directive pointing to https://ericevans.dev/sitemap.xml, plain text served automatically by SvelteKit static directory. Removed extraneous comments for a clean, spec-compliant file.",
      "spec": "specs/robots-txt.md"
    },
    {
      "id": "print-stylesheet",
      "title": "Implement Print Stylesheet",
      "description": "Added @media print block at end of src/app.css per specs/print-stylesheet.md — @page 1.5cm margins, hides nav/footer status/decorative overlays/CTA button/marquee animation, forces black-on-white with system serif body font (Fira Code headings), appends URLs after external links, break-inside:avoid on cards and sections, greyscale images, shows skills marquee as static wrapped grid, accent color mapped to dark grey. Pure CSS, no JS required.",
      "spec": "specs/print-stylesheet.md"
    },
    {
      "id": "sitemap",
      "title": "Implement XML Sitemap",
      "description": "Implemented /sitemap.xml SvelteKit server route per specs/sitemap.md — prerendered XML Sitemap 0.9 at build time, lists homepage with lastmod (build date), monthly changefreq, priority 1.0. Correct domain (ericevans.dev), application/xml content-type. Routes array ready for future pages. robots.txt already had Sitemap directive.",
      "spec": "specs/sitemap.md"
    },
    {
      "id": "page-transitions",
      "title": "Implement Page Transitions",
      "description": "Added View Transitions API cross-fade via SvelteKit onNavigate hook in +layout.svelte. CSS ::view-transition-old/new pseudo-elements with 150ms fade-out / 200ms ease-out fade-in. Progressive enhancement — browsers without View Transitions API get instant navigation. Respects data-reduce-motion attribute (skips transition entirely in JS) and prefers-reduced-motion (suppresses animation in CSS). Compositor-friendly opacity-only animation, no additional JS libraries.",
      "spec": "specs/page-transitions.md"
    },
    {
      "id": "back-to-top",
      "title": "Implement Back to Top Button",
      "description": "Built fixed-position scroll-to-top button per specs/back-to-top.md — appears after 400px scroll, smooth scroll to top, fade+translate entry/exit animations (200ms ease-out in, 150ms ease-in out), RAF-throttled scroll listener, system-monitor styled (bg-surface, border-dim, Material Symbols keyboard_arrow_up icon), hover effects (border-accent/50, bg-surface-highlight, text-text-main), active scale(0.95), aria-label='Scroll to top', dynamic tabindex, focus-visible accent ring, reduced-motion support (instant opacity, no translate, behavior:'auto'), responsive positioning (bottom-4 right-4 mobile, bottom-6 right-6 desktop). Component: src/lib/components/ui/BackToTop.svelte, mounted in +layout.svelte.",
      "spec": "specs/back-to-top.md"
    },
    {
      "id": "loading-screen",
      "title": "Implement Loading / Splash Screen",
      "description": "Built system-boot themed splash overlay per specs/loading-screen.md — sequential terminal boot lines (EE_SYS v2.0_STABLE, loading modules, initializing interface, establishing connection, SYSTEM READY) with staggered 200ms reveal and line-appear animation. Accent-colored 'OK' status and 'SYSTEM READY' text. Accent progress bar fills in sync with boot lines. 400ms ease-out fade-out exit. sessionStorage 'boot-shown' flag for once-per-session display. Reduced-motion and prefers-reduced-motion skip (instant content reveal). aria-live='polite' on terminal block, aria-hidden on dismissed overlay. Responsive max-w-md centered terminal block with text-sm/text-base scaling. Non-blocking ~1.5s total duration. Component: src/lib/components/ui/LoadingScreen.svelte, mounted in +layout.svelte.",
      "spec": "specs/loading-screen.md"
    },
    {
      "id": "toast-notifications",
      "title": "Implement Toast Notifications",
      "description": "Built reusable toast notification system per specs/toast-notifications.md — Svelte 5 rune-based ToastStore (src/lib/stores/toast.svelte.ts) with $state array, addToast/dismissToast exports, crypto.randomUUID() IDs, max 3 visible toasts with oldest eviction. ToastContainer component (src/lib/components/ui/ToastContainer.svelte) with three variants: success (status-ok green, STATUS: label), error (accent red, ERROR: label), info (text-muted, INFO: label). Left 4px accent border, status dot, uppercase mono label, dismiss button. 4s auto-dismiss with hover-pause timers. Slide-in from right (200ms ease-out) / slide-out (150ms ease-in) animations. Reduced-motion support via data-reduce-motion and prefers-reduced-motion (instant show/hide). role='status' with aria-live='polite' (assertive for errors), aria-label='Dismiss notification' on close button. Responsive: full-width on mobile (bottom-4 inset-x-4), max-w-24rem bottom-right on desktop. Mounted in +layout.svelte.",
      "spec": "specs/toast-notifications.md"
    },
    {
      "id": "theme-toggle",
      "title": "Add Dark/Light Theme Toggle",
      "description": "Added dark/light theme toggle per specs/theme-toggle.md — Svelte 5 rune-based ThemeStore (src/lib/stores/theme.svelte.ts) with $state, localStorage persistence (key: 'theme'), prefers-color-scheme detection as default, OS preference change listener. Uses .dark class on <html> with FOUC-prevention blocking script in app.html. Light-mode CSS custom property overrides in app.css (warm parchment #F9F1CB backgrounds, dark text #1A1816, tan borders #C9C0A0, lichen green #4A7C59 status-ok). Accent #B80C09 unchanged across both modes. Toggle button in desktop nav (Material Symbols light_mode/dark_mode icons, border+hover styling matching animation toggle) and mobile menu (labeled row with Dark/Light indicator). Dynamic aria-label describes resulting action. Light-mode scrollbar and selection overrides included.",
      "spec": "specs/theme-toggle.md"
    },
    {
      "id": "keyboard-shortcuts",
      "title": "Implement Keyboard Shortcuts",
      "description": "Built global keyboard shortcuts with help modal per specs/keyboard-shortcuts.md — ? key opens terminal-styled modal listing all shortcuts. Shortcuts: ? (help modal), t (theme toggle), m (motion toggle), 1-7 (section navigation via scrollIntoView), h (scroll to top), Escape (close modal). Modal styled as terminal reference card (bg-surface, border-border-dim, mono font, accent-colored kbd elements). Focus trap within modal, backdrop click/Escape to close. Form-field suppression (skips input/textarea/contenteditable). Reduced-motion support (no scale animation, smooth→auto scroll). Added id='competencies' to CoreCompetencies and id='interests' to Interests sections for number-key navigation. Component: src/lib/components/ui/KeyboardShortcuts.svelte, mounted in +layout.svelte.",
      "spec": "specs/keyboard-shortcuts.md"
    }
  ]
}
